# Taps
tap "homebrew/bundle"
tap "huynhducduy/zen-browser" # Единственный живой тап для Zen

# CLI Tools
brew "git"
brew "node"
brew "pnpm"
brew "neovim", args: ["--HEAD"] # Та самая 0.12 alpha
brew "eza"
brew "yazi"
brew "python@3.12"
brew "pipx"

# Apps (Casks)
cask "telegram"
cask "zen-browser"
cask "ticktick"
cask "wezterm"
cask "microsoft-office"
cask "yandex-music"
cask "obsidian"
cask "figma"
cask "google-chrome"
cask "vial"
cask "screen-studio"
cask "mytonwallet"
cask "logi-options-plus"
cask "keycastr"
cask "hiddify"
cask "cyberduck"
cask "cleanshot"
cask "caffeine"
cask "audacity"
cask "raycast"
